---
kind: method
id: M:Autodesk.Revit.DB.IExportContext.OnFaceEnd(Autodesk.Revit.DB.FaceNode)
source: html/49e6eaf6-80e3-53bd-14c2-8fe999afb70b.htm
---
# Autodesk.Revit.DB.IExportContext.OnFaceEnd Method

This method marks the end of the current face being exported.

## Syntax (C#)
```csharp
void OnFaceEnd(
	FaceNode node
)
```

## Parameters
- **node** (`Autodesk.Revit.DB.FaceNode`) - An output node that represents a Face.